УТ/src/InformationRegisters/CRM_ПланПродаж/CRM_ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПланПродаж</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПрогноз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПрогноз</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланаРодителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрогноз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланПродаж</name>
    <type>
      <types>CatalogRef.CRM_ПланПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодПлана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПланаПродаж</name>
    <type>
      <types>CatalogRef.CRM_КлючиАналитикиПланаПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УровеньИерархии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_ПланПродаж/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОтменитьСогласованиеВверх") Тогда
		СнятьУтверждениеСВерхнихУровней(ЭтотОбъект[0]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СнятьУтверждениеСВерхнихУровней(Запись)
	
	Если Не ЗначениеЗаполнено(Запись.ИдентификаторСтрокиРодителя) Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	CRM_ПланПродаж.ПланПродаж КАК ПланПродаж,
	|	CRM_ПланПродаж.ПериодПлана КАК ПериодПлана,
	|	CRM_ПланПродаж.АналитикаУчетаПланаПродаж КАК АналитикаУчетаПланаПродаж,
	|	CRM_ПланПродаж.УровеньИерархии КАК УровеньИерархии,
	|	CRM_ПланПродаж.Периодичность КАК Периодичность
	|ИЗ
	|	РегистрСведений.CRM_ПланПродаж КАК CRM_ПланПродаж
	|ГДЕ
	|	CRM_ПланПродаж.ИдентификаторСтроки = &ИдентификаторСтроки");
	Запрос.УстановитьПараметр("ИдентификаторСтроки", Запись.ИдентификаторСтрокиРодителя);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьРодителя = РегистрыСведений.CRM_ПланПродаж.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРодителя, Выборка);
		ЗаписьРодителя.Прочитать();
		Если ЗаписьРодителя.Выбран() Тогда
			ЗаписьРодителя.Согласовано = Ложь;
			ЗаписьРодителя.Записать();
		КонецЕсли;
	КонецЦикла;
	СнятьУтверждениеСВерхнихУровней(ЗаписьРодителя);
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
